talents_map = {
    '10591': {
        'name': '普通攻擊·不動流格鬥術'
    },
    '10592': {
        'name': '勠心拳'
    },
    '10595': {
        'name': '聚風蹴'
    },
    '5921': {
        'name': '反論稽古'
    },
    '5922': {
        'name': '因由勘破'
    },
    '5923': {
        'name': '在罪之先'
    },
    "10661": {
        "name": "普通攻擊·神里流·轉"
    },
    "10662": {
        "name": "神里流·鏡花"
    },
    "10665": {
        "name": "神里流·水囿"
    },
    "6621": {
        "name": "神里流·清瀧繞峰"
    },
    "6622": {
        "name": "神里流·破月漸盈"
    },
    "6623": {
        "name": "神里流·日常茶飯"
    },
    "10631": {
        "name": "普通攻擊·踏辰攝斗"
    },
    "10632": {
        "name": "仰靈威召將役咒"
    },
    "10635": {
        "name": "神女遣靈真訣"
    },
    "6321": {
        "name": "大洞彌羅尊法"
    },
    "6322": {
        "name": "縛靈通真法印"
    },
    "6323": {
        "name": "來復知時"
    },
    "10606": {
        "name": "普通攻擊·潛形隱曜弓"
    },
    "10607": {
        "name": "縈絡縱命索"
    },
    "10610": {
        "name": "淵圖玲瓏骰"
    },
    "6021": {
        "name": "猜先有方"
    },
    "6022": {
        "name": "妙轉隨心"
    },
    "6023": {
        "name": "長考一著"
    },
    "10581": {
        "name": "普通攻擊·狐靈食罪式"
    },
    "10582": {
        "name": "野干役咒·殺生櫻"
    },
    "10585": {
        "name": "大密法·天狐顯真"
    },
    "5821": {
        "name": "神籬之御蔭"
    },
    "5822": {
        "name": "啟蜇之祝詞"
    },
    "5823": {
        "name": "野狐說禪"
    },
    "10571": {
        "name": "普通攻擊· 喧嘩屋傳說"
    },
    "10572": {
        "name": "魔殺絕技·赤牛發破！"
    },
    "10575": {
        "name": "最惡鬼王·一斗轟臨！！"
    },
    "5721": {
        "name": "荒瀧第一"
    },
    "5722": {
        "name": "赤鬼之血"
    },
    "5723": {
        "name": "幹裂枝碎"
    },
    "10541": {
        "name": "普通攻擊·水有常形"
    },
    "10542": {
        "name": "海月之誓"
    },
    "10545": {
        "name": "海人化羽"
    },
    "5421": {
        "name": "匣中玉櫛"
    },
    "5422": {
        "name": "真珠御唄"
    },
    "5423": {
        "name": "海祇姬君"
    },
    "5425": {
        "name": "廟算無遺"
    },
    "10521": {
        "name": "普通攻擊·源流"
    },
    "10522": {
        "name": "神變·惡曜開眼"
    },
    "10525": {
        "name": "奧義·夢想真說"
    },
    "5221": {
        "name": "萬千的願望"
    },
    "5222": {
        "name": "殊勝之御體"
    },
    "5225": {
        "name": "天下名物狩"
    },
    "10511": {
        "name": "普通攻擊·西風劍術·宗室"
    },
    "10512": {
        "name": "冰潮的渦漩"
    },
    "10515": {
        "name": "凝浪之光劍"
    },
    "5121": {
        "name": "潮捲冰削"
    },
    "5122": {
        "name": "戰慾湧現"
    },
    "5123": {
        "name": "貴族的自省"
    },
    "10491": {
        "name": "普通攻擊·煙火打揚"
    },
    "10492": {
        "name": "焰硝庭火舞"
    },
    "10495": {
        "name": "琉金雲間草"
    },
    "4921": {
        "name": "袖火百景圖"
    },
    "4922": {
        "name": "炎晝風物詩"
    },
    "4923": {
        "name": "炎色配比法"
    },
    "10471": {
        "name": "普通攻擊·我流劍術"
    },
    "10472": {
        "name": "千早振"
    },
    "10475": {
        "name": "萬葉之一刀"
    },
    "4721": {
        "name": "相聞之劍法"
    },
    "4722": {
        "name": "風物之詩詠"
    },
    "4723": {
        "name": "松風霞立"
    },
    "10461": {
        "name": "普通攻擊·往生秘傳槍法"
    },
    "10462": {
        "name": "蝶引來生"
    },
    "10463": {
        "name": "安神秘法"
    },
    "4621": {
        "name": "蝶隱之時"
    },
    "4622": {
        "name": "血之灶火"
    },
    "4623": {
        "name": "多多益善"
    },
    "10421": {
        "name": "普通攻擊·雲來劍法"
    },
    "10422": {
        "name": "星斗歸位"
    },
    "10425": {
        "name": "天街巡遊"
    },
    "4221": {
        "name": "抵天雷罰"
    },
    "4222": {
        "name": "玉衡之貴"
    },
    "4223": {
        "name": "總務土地"
    },
    "10411": {
        "name": "普通攻擊·因果點破"
    },
    "10412": {
        "name": "水中幻願"
    },
    "10413": {
        "name": "虛實流動"
    },
    "10415": {
        "name": "星命定軌"
    },
    "4121": {
        "name": "「老太婆來抓我啊！」"
    },
    "4122": {
        "name": "「託付於命運吧！」"
    },
    "4123": {
        "name": "運行原理"
    },
    "10386": {
        "name": "普通攻擊·西風劍術·白"
    },
    "10387": {
        "name": "創生法·擬造陽華"
    },
    "10388": {
        "name": "誕生式·大地之潮"
    },
    "3821": {
        "name": "白堊色的威壓"
    },
    "3822": {
        "name": "瓶中人的天慧"
    },
    "3823": {
        "name": "天才的發現"
    },
    "10371": {
        "name": "普通攻擊·流天射術"
    },
    "10372": {
        "name": "山澤麟跡"
    },
    "10373": {
        "name": "降眾天華"
    },
    "3721": {
        "name": "唯此一心"
    },
    "3722": {
        "name": "天地交泰"
    },
    "3723": {
        "name": "藏弓待用"
    },
    "10351": {
        "name": "普通攻擊·雲來古劍法"
    },
    "10352": {
        "name": "仙法·寒病鬼差"
    },
    "10353": {
        "name": "仙法·救苦渡厄"
    },
    "3521": {
        "name": "延命妙法"
    },
    "3522": {
        "name": "玉籤偶開"
    },
    "3523": {
        "name": "前塵舊憶"
    },
    "10331": {
        "name": "普通攻擊·斷雨"
    },
    "10332": {
        "name": "魔王武裝·狂瀾"
    },
    "10333": {
        "name": "極惡技·盡滅閃"
    },
    "3321": {
        "name": "永無謝幕"
    },
    "3322": {
        "name": "水形劍"
    },
    "3323": {
        "name": "諸武精通"
    },
    "10301": {
        "name": "普通攻擊·岩雨"
    },
    "10302": {
        "name": "地心"
    },
    "10303": {
        "name": "天星"
    },
    "3021": {
        "name": "懸岩宸斷"
    },
    "3022": {
        "name": "炊金饌玉"
    },
    "3023": {
        "name": "晶石命理"
    },
    "10291": {
        "name": "普通攻擊·砰砰"
    },
    "10292": {
        "name": "蹦蹦炸彈"
    },
    "10295": {
        "name": "轟轟火花"
    },
    "2921": {
        "name": "砰砰禮物"
    },
    "2922": {
        "name": "火花無限"
    },
    "2923": {
        "name": "全是寶藏"
    },
    "10261": {
        "name": "普通攻擊·捲積微塵"
    },
    "10262": {
        "name": "風輪兩立"
    },
    "10265": {
        "name": "靖妖儺舞"
    },
    "2621": {
        "name": "降魔·平妖大聖"
    },
    "2622": {
        "name": "壞劫·國土碾塵"
    },
    "2623": {
        "name": "神通·空中自在法"
    },
    "10221": {
        "name": "普通攻擊·神代射術"
    },
    "10224": {
        "name": "高天之歌"
    },
    "10225": {
        "name": "風神之詩"
    },
    "2221": {
        "name": "緒風之擁"
    },
    "2222": {
        "name": "暴風之眼"
    },
    "2223": {
        "name": "恆風隨行"
    },
    "10160": {
        "name": "普通攻擊·淬煉之劍"
    },
    "10161": {
        "name": "逆焰之刃"
    },
    "10165": {
        "name": "黎明"
    },
    "1621": {
        "name": "永不休止"
    },
    "1622": {
        "name": "熔毀之翼"
    },
    "1623": {
        "name": "晨曦的傳統"
    },
    "10031": {
        "name": "普通攻擊·西風劍術"
    },
    "10033": {
        "name": "風壓劍"
    },
    "10034": {
        "name": "蒲公英之風"
    },
    "321": {
        "name": "順風而行"
    },
    "322": {
        "name": "聽憑風引"
    },
    "323": {
        "name": "引領之風"
    },
    "10024": {
        "name": "普通攻擊·神里流·傾"
    },
    "10018": {
        "name": "神里流·冰華"
    },
    "10013": {
        "name": "神里流·霰步"
    },
    "10019": {
        "name": "神里流·霜滅"
    },
    "221": {
        "name": "天罪國罪鎮詞"
    },
    "222": {
        "name": "寒天宣命祝詞"
    },
    "223": {
        "name": "鑑查心得"
    },
    "10621": {
        "name": "普通攻擊·快速射擊"
    },
    "10622": {
        "name": "冰塵雪野"
    },
    "10625": {
        "name": "黎明預言"
    },
    "6221": {
        "name": "戰鬥覆蓋"
    },
    "6222": {
        "name": "強力攻擊"
    },
    "6223": {
        "name": "荒野獵人"
    },
    "10651": {
        "name": "普通攻擊·忍流飛刃斬"
    },
    "10652": {
        "name": "越祓雷草之輪"
    },
    "10655": {
        "name": "御詠鳴神刈山祭"
    },
    "6521": {
        "name": "破籠之志"
    },
    "6522": {
        "name": "安心之所"
    },
    "6523": {
        "name": "久時的祝禱"
    },
    "10641": {
        "name": "普通攻擊·拂雲出手"
    },
    "10642": {
        "name": "旋雲開相"
    },
    "10643": {
        "name": "破嶂見旌儀"
    },
    "6421": {
        "name": "務守本真"
    },
    "6422": {
        "name": "莫從恆蹊"
    },
    "6423": {
        "name": "清食養性"
    },
    "10561": {
        "name": "普通攻擊·天狗傳弓術"
    },
    "10562": {
        "name": "鴉羽天狗霆雷召咒"
    },
    "10565": {
        "name": "煌煌千道鎮式"
    },
    "5621": {
        "name": "不動心"
    },
    "5622": {
        "name": "御公儀"
    },
    "5623": {
        "name": "檢地"
    },
    "10551": {
        "name": "普通攻擊·呲牙裂扇箭"
    },
    "10552": {
        "name": "犬坂吠吠方圓陣"
    },
    "10555": {
        "name": "獸牙逐突形勝戰法"
    },
    "5521": {
        "name": "不畏風雨"
    },
    "5522": {
        "name": "報恩之守"
    },
    "5523": {
        "name": "亮晶晶發現術"
    },
    "10531": {
        "name": "普通攻擊·忍刀·終末番"
    },
    "10532": {
        "name": "嗚呼流·風隱急進"
    },
    "10535": {
        "name": "嗚呼流·影貉繚亂"
    },
    "5321": {
        "name": "更加合適的人選"
    },
    "5322": {
        "name": "早柚不用工作啦"
    },
    "5323": {
        "name": "嗚呼流·屏息秘傳"
    },
    "10501": {
        "name": "普通攻擊·迅破槍勢"
    },
    "10502": {
        "name": "烈燒佑命之侍護"
    },
    "10505": {
        "name": "真紅熾火之大鎧"
    },
    "5021": {
        "name": "甲衣交疊"
    },
    "5022": {
        "name": "烈火攻燔"
    },
    "5023": {
        "name": "懸鯛狩"
    },
    "10481": {
        "name": "普通攻擊·火漆製印"
    },
    "10482": {
        "name": "丹書立約"
    },
    "10485": {
        "name": "憑此結契"
    },
    "4821": {
        "name": "相關條款"
    },
    "4822": {
        "name": "法獸灼眼"
    },
    "4823": {
        "name": "博聞強記"
    },
    "10451": {
        "name": "普通攻擊·教會槍術"
    },
    "10452": {
        "name": "噬罪的告解"
    },
    "10453": {
        "name": "終命的聖禮"
    },
    "4521": {
        "name": "聆聽懺悔的幽影"
    },
    "4522": {
        "name": "暗中支援的黯色"
    },
    "4523": {
        "name": "夜行"
    },
    "10441": {
        "name": "普通攻擊·炎舞"
    },
    "10442": {
        "name": "熱情拂掃"
    },
    "10443": {
        "name": "叛逆刮弦"
    },
    "4421": {
        "name": "「沒聽眾也要演奏…」"
    },
    "4422": {
        "name": "「…這才是搖滾！」"
    },
    "4423": {
        "name": "搖滾的食譜"
    },
    "10431": {
        "name": "普通攻擊·簡式風靈作成"
    },
    "10432": {
        "name": "風靈作成·陸參零捌"
    },
    "10435": {
        "name": "禁·風靈作成·柒伍同構貳型"
    },
    "4321": {
        "name": "觸媒置換術"
    },
    "4322": {
        "name": "小小的慧風"
    },
    "4323": {
        "name": "不穩定發現"
    },
    "10391": {
        "name": "普通攻擊·獵人射術"
    },
    "10392": {
        "name": "貓爪凍凍"
    },
    "10395": {
        "name": "最烈特調"
    },
    "3921": {
        "name": "貓尾隱藏菜單"
    },
    "3922": {
        "name": "滑稽百出的醉相"
    },
    "3923": {
        "name": "附贈的下酒菜"
    },
    "10401": {
        "name": "普通攻擊·滅邪四式"
    },
    "10402": {
        "name": "靈刃·重華疊霜"
    },
    "10403": {
        "name": "靈刃·雲開星落"
    },
    "3621": {
        "name": "吐納真定"
    },
    "3622": {
        "name": "追冰劍訣"
    },
    "3623": {
        "name": "雲遊山海"
    },
    "10341": {
        "name": "普通攻擊·西風劍術·女僕"
    },
    "10342": {
        "name": "護心鎧"
    },
    "10343": {
        "name": "大掃除"
    },
    "3421": {
        "name": "全心全意"
    },
    "3422": {
        "name": "乾淨俐落"
    },
    "3423": {
        "name": "女僕的態度"
    },
    "10321": {
        "name": "普通攻擊·好運劍"
    },
    "10322": {
        "name": "熱情超載"
    },
    "10323": {
        "name": "美妙旅程"
    },
    "3221": {
        "name": "熱情復燃"
    },
    "3222": {
        "name": "無畏的熱血"
    },
    "3223": {
        "name": "應該安全"
    },
    "10311": {
        "name": "普通攻擊·罪滅之矢"
    },
    "10312": {
        "name": "夜巡影翼"
    },
    "10313": {
        "name": "至夜幻現"
    },
    "3121": {
        "name": "噬星魔鴉"
    },
    "3122": {
        "name": "斷罪雷影"
    },
    "3123": {
        "name": "吾之後花園"
    },
    "10271": {
        "name": "普通攻擊·千金擲"
    },
    "10272": {
        "name": "璇璣屏"
    },
    "10274": {
        "name": "天權崩玉"
    },
    "2721": {
        "name": "星移勢轉"
    },
    "2722": {
        "name": "儲之千日，用之一刻"
    },
    "2723": {
        "name": "奇石珠寶錄"
    },
    "10381": {
        "name": "普通攻擊·古華劍法"
    },
    "10382": {
        "name": "古華劍·畫雨籠山"
    },
    "10385": {
        "name": "古華劍·裁雨留虹"
    },
    "2521": {
        "name": "生水要訣"
    },
    "2522": {
        "name": "虛實工筆"
    },
    "2523": {
        "name": "靈光乍現"
    },
    "10241": {
        "name": "普通攻擊·征濤"
    },
    "10242": {
        "name": "捉浪"
    },
    "10245": {
        "name": "斫雷"
    },
    "2421": {
        "name": "遍宇靈光"
    },
    "2422": {
        "name": "霹靂連霄"
    },
    "2423": {
        "name": "擁濤踏潮"
    },
    "10231": {
        "name": "普通攻擊·白案功夫"
    },
    "10232": {
        "name": "鍋巴出擊"
    },
    "10235": {
        "name": "旋火輪"
    },
    "2321": {
        "name": "交叉火力"
    },
    "2322": {
        "name": "絕雲朝天椒"
    },
    "2323": {
        "name": "萬民堂大廚"
    },
    "10041": {
        "name": "普通攻擊·神射手"
    },
    "10032": {
        "name": "爆彈玩偶"
    },
    "10017": {
        "name": "箭雨"
    },
    "2121": {
        "name": "百發百中！"
    },
    "2122": {
        "name": "壓制射擊"
    },
    "2123": {
        "name": "飛行冠軍"
    },
    "10201": {
        "name": "普通攻擊·鋼脊"
    },
    "10202": {
        "name": "利爪與蒼雷"
    },
    "10203": {
        "name": "雷牙"
    },
    "2021": {
        "name": "覺醒"
    },
    "2022": {
        "name": "饑餓"
    },
    "2023": {
        "name": "奔狼"
    },
    "10073": {
        "name": "普通攻擊·儀典劍術"
    },
    "10074": {
        "name": "霜襲"
    },
    "10075": {
        "name": "凜冽輪舞"
    },
    "1521": {
        "name": "冷血之劍"
    },
    "1522": {
        "name": "冰淵之心"
    },
    "1523": {
        "name": "隱藏的實力"
    },
    "10070": {
        "name": "普通攻擊·水之淺唱"
    },
    "10071": {
        "name": "演唱，開始♪"
    },
    "10072": {
        "name": "閃耀奇跡♪"
    },
    "1421": {
        "name": "光輝的季節"
    },
    "1422": {
        "name": "安可"
    },
    "1423": {
        "name": "心意♪注入"
    },
    "10060": {
        "name": "普通攻擊·指尖雷暴"
    },
    "10061": {
        "name": "蒼雷"
    },
    "10062": {
        "name": "薔薇的雷光"
    },
    "421": {
        "name": "電感餘震"
    },
    "422": {
        "name": "靜電場力"
    },
    "423": {
        "name": "藥劑通識"
    }
}
